# Задание №1
text = "Мама мыла раму"
print(text[0])
print(text[-1])
print(text[1:3])
print(len(text))

# Задание №2
name = "Yury"
age = "40"
message = "Меня зовут " + name + " и мне " + age + " лет."
message_f = f"Меня зовут {name} и мне {age} лет."
text_to_escape = "Шла \"Саша\" по шоссе и \'сосала\'\\ сушку\\"
print(text_to_escape)

# Задание №3
text = "Python - лучший язык для автоматизации!"
print("Python" in text)
print("Мы работаем, чтобы стать лучше".replace(" ","*"))
print(text[-1] == "!")
print(text.lower())
